#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.sandbox-1.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1]
module.sandbox-2.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sandbox-1.azurerm_network_security_group.nsg_private will be created
  + resource "azurerm_network_security_group" "nsg_private" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-private"
      + resource_group_name = "sandbox-1"
      + security_rule       = (known after apply)
    }

  # module.sandbox-1.azurerm_network_security_group.nsg_public will be created
  + resource "azurerm_network_security_group" "nsg_public" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-public"
      + resource_group_name = "sandbox-1"
      + security_rule       = (known after apply)
    }

  # module.sandbox-1.azurerm_network_security_rule.allow_private_to_public will be created
  + resource "azurerm_network_security_rule" "allow_private_to_public" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.1.0/24"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow-Private-to-Public"
      + network_security_group_name = "nsg-private"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "sandbox-1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-1.azurerm_network_security_rule.allow_public_outbound will be created
  + resource "azurerm_network_security_rule" "allow_public_outbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow-Internet-Outbound"
      + network_security_group_name = "nsg-public"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "sandbox-1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-1.azurerm_network_security_rule.deny_private_outbound_all will be created
  + resource "azurerm_network_security_rule" "deny_private_outbound_all" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Deny-All-Outbound"
      + network_security_group_name = "nsg-private"
      + priority                    = 200
      + protocol                    = "*"
      + resource_group_name         = "sandbox-1"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-1.azurerm_subnet.private will be created
  + resource "azurerm_subnet" "private" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-private"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "sandbox-1"
      + virtual_network_name                           = "SandboxVNet"
    }

  # module.sandbox-1.azurerm_subnet.public will be created
  + resource "azurerm_subnet" "public" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-public"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "sandbox-1"
      + virtual_network_name                           = "SandboxVNet"
    }

  # module.sandbox-1.azurerm_subnet_network_security_group_association.private_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "private_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sandbox-1.azurerm_subnet_network_security_group_association.public_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "public_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sandbox-1.azurerm_virtual_network.sandbox_vnet will be created
  + resource "azurerm_virtual_network" "sandbox_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "SandboxVNet"
      + resource_group_name = "sandbox-1"
      + subnet              = (known after apply)
    }

  # module.sandbox-2.azurerm_network_security_group.nsg_private will be created
  + resource "azurerm_network_security_group" "nsg_private" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-private"
      + resource_group_name = "sandbox-2"
      + security_rule       = (known after apply)
    }

  # module.sandbox-2.azurerm_network_security_group.nsg_public will be created
  + resource "azurerm_network_security_group" "nsg_public" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-public"
      + resource_group_name = "sandbox-2"
      + security_rule       = (known after apply)
    }

  # module.sandbox-2.azurerm_network_security_rule.allow_private_to_public will be created
  + resource "azurerm_network_security_rule" "allow_private_to_public" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.1.0/24"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow-Private-to-Public"
      + network_security_group_name = "nsg-private"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "sandbox-2"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-2.azurerm_network_security_rule.allow_public_outbound will be created
  + resource "azurerm_network_security_rule" "allow_public_outbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow-Internet-Outbound"
      + network_security_group_name = "nsg-public"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "sandbox-2"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-2.azurerm_network_security_rule.deny_private_outbound_all will be created
  + resource "azurerm_network_security_rule" "deny_private_outbound_all" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Deny-All-Outbound"
      + network_security_group_name = "nsg-private"
      + priority                    = 200
      + protocol                    = "*"
      + resource_group_name         = "sandbox-2"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-2.azurerm_subnet.private will be created
  + resource "azurerm_subnet" "private" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-private"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "sandbox-2"
      + virtual_network_name                           = "SandboxVNet"
    }

  # module.sandbox-2.azurerm_subnet.public will be created
  + resource "azurerm_subnet" "public" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-public"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "sandbox-2"
      + virtual_network_name                           = "SandboxVNet"
    }

  # module.sandbox-2.azurerm_subnet_network_security_group_association.private_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "private_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sandbox-2.azurerm_subnet_network_security_group_association.public_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "public_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sandbox-2.azurerm_virtual_network.sandbox_vnet will be created
  + resource "azurerm_virtual_network" "sandbox_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "SandboxVNet"
      + resource_group_name = "sandbox-2"
      + subnet              = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ItsKev, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*